Find the price of the cheapest property for every city.

https://platform.stratascratch.com/coding/9625-cheapest-properties?code_type=2

In [1]:
import pandas as pd

In [2]:
airbnb_search_details = pd.read_csv('data/airbnb_search_details.csv')
airbnb_search_details = airbnb_search_details[['city', 'price']]
airbnb_search_details.head()

  city   price
0  NYC  555.68
1   LA  366.36
2   SF  482.83
3  NYC  448.86
4   LA  506.89

In [3]:
cheapest_property = airbnb_search_details.groupby(['city']).min('price').reset_index()
cheapest_property

      city   price
0   Boston  385.01
1  Chicago  487.52
2       DC  417.44
3       LA  270.81
4      NYC  340.12
5       SF  424.85

In [4]:
result = cheapest_property.rename(columns = {'price': 'min_price'})
result

      city  min_price
0   Boston     385.01
1  Chicago     487.52
2       DC     417.44
3       LA     270.81
4      NYC     340.12
5       SF     424.85